#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with module.mta-sts.aws_s3_bucket.sts,
  on .terraform/modules/mta-sts/main.tf line 11, in resource "aws_s3_bucket" "sts":
  11: resource "aws_s3_bucket" "sts" {

Use the aws_s3_bucket_versioning resource instead

(and 3 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.mta-sts.random_id.sts: Refreshing state... [id=rBJbQSljHWg]
module.mta-sts.data.archive_file.lambda_archive: Reading...
module.mta-sts.data.archive_file.lambda_archive: Read complete after 0s [id=9701cf8067f2aff9cab5287d45f3004e2170c7a4]
module.mta-sts.data.aws_cloudfront_cache_policy.optimized: Reading...
module.website.data.aws_canonical_user_id.default[0]: Reading...
module.www-website.data.aws_canonical_user_id.default[0]: Reading...
module.mta-sts.data.aws_cloudfront_origin_request_policy.s3origin: Reading...
module.website.data.aws_partition.current[0]: Reading...
aws_route53_zone.this: Refreshing state... [id=Z048504419NDW43VP1NZI]
module.ses.data.aws_region.this: Reading...
module.www-website.data.aws_partition.current[0]: Reading...
module.dnssec.data.aws_caller_identity.this: Reading...
module.ses.data.aws_region.this: Read complete after 0s [id=us-east-1]
module.mta-sts.data.aws_iam_policy_document.lambda: Reading...
module.www-website.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.website.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.mta-sts.data.aws_iam_policy_document.lambda: Read complete after 0s [id=1770280424]
module.mta-sts.data.aws_iam_policy_document.assume_role: Reading...
module.mta-sts.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2950941412]
module.dnssec.data.aws_caller_identity.this: Read complete after 0s [id=072105303426]
module.dnssec.data.aws_iam_policy_document.ksk: Reading...
module.dnssec.data.aws_iam_policy_document.ksk: Read complete after 0s [id=2089232298]
module.dnssec.module.kms_key.aws_kms_key.default[0]: Refreshing state... [id=b4daeeca-6635-4f5a-888e-d1fd04fff202]
module.www-website.data.aws_canonical_user_id.default[0]: Read complete after 0s [id=0415ac49d2dbae53693985f648ef7b9ed41476f5aca8c9cafc28423e8d578bd3]
module.website.data.aws_canonical_user_id.default[0]: Read complete after 1s [id=0415ac49d2dbae53693985f648ef7b9ed41476f5aca8c9cafc28423e8d578bd3]
module.mta-sts.data.aws_cloudfront_origin_request_policy.s3origin: Read complete after 1s [id=88a5eaf4-2fd4-4709-b370-b4c650ea3fcf]
module.mta-sts.data.aws_cloudfront_cache_policy.optimized: Read complete after 1s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.dnssec.module.kms_key.aws_kms_alias.default[0]: Refreshing state... [id=alias/ksk]
module.caa.data.aws_route53_zone.zone: Reading...
module.dnssec.random_string.ksk["this"]: Refreshing state... [id=4ZGn3YNhngcrGxTYrG6Ye9QDGmBtyyU9]
module.mta-sts.aws_route53_record.sts: Refreshing state... [id=Z048504419NDW43VP1NZI__mta-sts_TXT]
module.acm_request_certificate.aws_acm_certificate.default[0]: Refreshing state... [id=arn:aws:acm:us-east-1:072105303426:certificate/b89f103c-57a2-4aa5-bd9c-bfed2eb09df0]
module.ses.data.aws_route53_zone.zone: Reading...
module.mta-sts.data.aws_route53_zone.zone: Reading...
module.website.aws_s3_bucket.default[0]: Refreshing state... [id=kq4afy.xyz]
module.acm_request_certificate.data.aws_route53_zone.default["kq4afy.xyz"]: Reading...
module.acm_request_certificate.data.aws_route53_zone.default["xyz"]: Reading...
module.www-website.aws_s3_bucket.default[0]: Refreshing state... [id=www.kq4afy.xyz]
module.dnssec.aws_route53_key_signing_key.this["this"]: Refreshing state... [id=Z048504419NDW43VP1NZI,4ZGn3YNhngcrGxTYrG6Ye9QDGmBtyyU9]
module.caa.data.aws_route53_zone.zone: Read complete after 0s [id=Z048504419NDW43VP1NZI]
module.caa.aws_route53_record.caa: Refreshing state... [id=Z048504419NDW43VP1NZI_kq4afy.xyz_CAA]
module.acm_request_certificate.data.aws_route53_zone.default["kq4afy.xyz"]: Read complete after 1s [id=Z048504419NDW43VP1NZI]
module.ses.data.aws_route53_zone.zone: Read complete after 1s [id=Z048504419NDW43VP1NZI]
module.ses.aws_ses_domain_identity.this: Refreshing state... [id=kq4afy.xyz]
module.ses.aws_ses_domain_dkim.this: Refreshing state... [id=kq4afy.xyz]
module.acm_request_certificate.data.aws_route53_zone.default["xyz"]: Read complete after 1s [id=Z048504419NDW43VP1NZI]
module.acm_request_certificate.aws_route53_record.default["kq4afy.xyz"]: Refreshing state... [id=Z048504419NDW43VP1NZI__f4debdcb895fe9f5481480281fa1a9e1.kq4afy.xyz._CNAME]
module.acm_request_certificate.aws_route53_record.default["*.kq4afy.xyz"]: Refreshing state... [id=Z048504419NDW43VP1NZI__f4debdcb895fe9f5481480281fa1a9e1.kq4afy.xyz._CNAME]
module.mta-sts.data.aws_route53_zone.zone: Read complete after 1s [id=Z048504419NDW43VP1NZI]
module.mta-sts.module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:072105303426:certificate/007c9e59-4bec-4cc3-a3c8-800774f4bf22]
module.mta-sts.aws_route53_record.mx[0]: Refreshing state... [id=Z048504419NDW43VP1NZI_kq4afy.xyz_MX]
module.mta-sts.aws_iam_role.lambda: Refreshing state... [id=origin-response-20221214025701967400000001]
module.mta-sts.aws_route53_record.smtp_tls: Refreshing state... [id=Z048504419NDW43VP1NZI__smtp._tls_TXT]
module.mta-sts.aws_s3_bucket.sts: Refreshing state... [id=mta-sts.kq4afy.xyz]
module.mta-sts.module.acm.data.aws_route53_zone.parent[0]: Reading...
module.www-website.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=www.kq4afy.xyz]
module.www-website.aws_s3_bucket_acl.default[0]: Refreshing state... [id=www.kq4afy.xyz,private]
module.www-website.aws_s3_bucket_website_configuration.redirect[0]: Refreshing state... [id=www.kq4afy.xyz]
module.www-website.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=www.kq4afy.xyz]
module.www-website.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=www.kq4afy.xyz]
module.ses.aws_route53_record.amazonses: Refreshing state... [id=Z048504419NDW43VP1NZI__amazonses_TXT]
module.ses.aws_ses_domain_mail_from.this: Refreshing state... [id=kq4afy.xyz]
module.ses.aws_route53_record.dkim_token[0]: Refreshing state... [id=Z048504419NDW43VP1NZI_6lw3a253ozyuket6fll7yjs5vykexy5t._domainkey_CNAME]
module.ses.aws_route53_record.dkim_token[1]: Refreshing state... [id=Z048504419NDW43VP1NZI_uzqb35ezy7hgs5nnjaobvqaqlwewdnk3._domainkey_CNAME]
module.ses.aws_route53_record.dkim_token[2]: Refreshing state... [id=Z048504419NDW43VP1NZI_7cdkztt35ggu2ra5hvixhabgdblxfhlx._domainkey_CNAME]
module.website.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=kq4afy.xyz]
module.website.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=kq4afy.xyz]
module.website.aws_s3_bucket_acl.default[0]: Refreshing state... [id=kq4afy.xyz,private]
module.website.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=kq4afy.xyz]
module.website.aws_s3_bucket_website_configuration.default[0]: Refreshing state... [id=kq4afy.xyz]
module.www-website.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.www-website.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=1132004489]
module.website.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.website.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=1132004489]
module.ses.aws_route53_record.ses_mail_from_txt: Refreshing state... [id=Z048504419NDW43VP1NZI_bounce.kq4afy.xyz_TXT]
module.ses.aws_route53_record.ses_mail_from_mx: Refreshing state... [id=Z048504419NDW43VP1NZI_bounce.kq4afy.xyz_MX]
module.mta-sts.module.acm.data.aws_route53_zone.parent[0]: Read complete after 0s [id=Z048504419NDW43VP1NZI]
module.ses.aws_ses_domain_identity_verification.this: Refreshing state... [id=kq4afy.xyz]
module.www-website.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.www-website.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=1132004489]
module.website.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.website.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=1132004489]
module.www-website.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2022-12-08T16:20:05Z]
module.website.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2022-12-08T16:20:05Z]
module.www-website.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=www.kq4afy.xyz]
module.mta-sts.module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z048504419NDW43VP1NZI__4ad5739a3729acc44f2d20905e007897.mta-sts.kq4afy.xyz._CNAME]
module.website.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=kq4afy.xyz]
module.mta-sts.aws_lambda_function.origin_response: Refreshing state... [id=mta-sts-kq4afy-xyz-origin-response]
module.mta-sts.aws_iam_role_policy.lambda: Refreshing state... [id=origin-response-20221214025701967400000001:origin-response-policy-20221214025702931500000002]
module.mta-sts.aws_s3_bucket_object.sts: Refreshing state... [id=.well-known/mta-sts.txt]
module.mta-sts.aws_cloudfront_origin_access_identity.sts: Refreshing state... [id=E2SNU9MMSZ189X]
module.mta-sts.aws_s3_bucket_public_access_block.sts: Refreshing state... [id=mta-sts.kq4afy.xyz]
module.mta-sts.aws_s3_bucket_object.favicon: Refreshing state... [id=favicon.ico]
module.mta-sts.aws_s3_bucket_policy.sts: Refreshing state... [id=mta-sts.kq4afy.xyz]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.mta-sts.module.acm.aws_acm_certificate.this[0] has changed
  ~ resource "aws_acm_certificate" "this" {
      ~ domain_validation_options = [
          - {
              - domain_name           = "mta-sts.kq4afy.xyz"
              - resource_record_name  = "_4ad5739a3729acc44f2d20905e007897.mta-sts.kq4afy.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_16f4f23e1ee5955537e1eb491a7fd76e.pmgvbzmzyk.acm-validations.aws."
            },
        ]
        id                        = "arn:aws:acm:us-east-1:072105303426:certificate/007c9e59-4bec-4cc3-a3c8-800774f4bf22"
      ~ status                    = "PENDING_VALIDATION" -> "FAILED"
        tags                      = {
            "Changed"   = "2022-12-14 02:57 UTC"
            "ManagedBy" = "Terraform"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mta-sts.module.acm.aws_route53_record.validation[0] has changed
  ~ resource "aws_route53_record" "validation" {
        id              = "Z048504419NDW43VP1NZI__4ad5739a3729acc44f2d20905e007897.mta-sts.kq4afy.xyz._CNAME"
        name            = "_4ad5739a3729acc44f2d20905e007897.mta-sts.kq4afy.xyz"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.caa.aws_route53_record.caa will be updated in-place
  ~ resource "aws_route53_record" "caa" {
        id              = "Z048504419NDW43VP1NZI_kq4afy.xyz_CAA"
        name            = "kq4afy.xyz"
      ~ records         = [
          + "0 issue \"amazon.com\"",
          + "0 issue \"letsencrypt.org\"",
            # (2 unchanged elements hidden)
        ]
        # (5 unchanged attributes hidden)
    }

  # module.mta-sts.data.aws_iam_policy_document.sts will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "sts" {
      + id        = (known after apply)
      + json      = (known after apply)
      + policy_id = "PolicyForCloudFrontPrivateContent"

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::mta-sts.kq4afy.xyz/*",
            ]
          + sid       = "1"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2SNU9MMSZ189X",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.mta-sts.aws_cloudfront_distribution.sts will be created
  + resource "aws_cloudfront_distribution" "sts" {
      + aliases                        = [
          + "mta-sts.kq4afy.xyz",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "MTA-STS: kq4afy.xyz"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods          = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id          = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = true
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          + target_origin_id         = "origin-bucket-mta-sts.kq4afy.xyz"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"

          + lambda_function_association {
              + event_type   = "origin-response"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:072105303426:function:mta-sts-kq4afy-xyz-origin-response:1"
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "mta-sts.kq4afy.xyz.s3.amazonaws.com"
          + origin_id           = "origin-bucket-mta-sts.kq4afy.xyz"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E2SNU9MMSZ189X"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:072105303426:certificate/007c9e59-4bec-4cc3-a3c8-800774f4bf22"
          + minimum_protocol_version = "TLSv1.2_2019"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.mta-sts.aws_iam_role.lambda will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "origin-response-20221214025701967400000001"
        name                  = "origin-response-20221214025701967400000001"
      ~ tags                  = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mta-sts.aws_lambda_function.origin_response will be updated in-place
  ~ resource "aws_lambda_function" "origin_response" {
        id                             = "mta-sts-kq4afy-xyz-origin-response"
      ~ tags                           = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
        } -> (known after apply)
      ~ tags_all                       = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
        } -> (known after apply)
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.mta-sts.aws_route53_record.mta-sts_A will be created
  + resource "aws_route53_record" "mta-sts_A" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mta-sts"
      + type            = "A"
      + zone_id         = "Z048504419NDW43VP1NZI"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.mta-sts.aws_route53_record.mta-sts_AAAA will be created
  + resource "aws_route53_record" "mta-sts_AAAA" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mta-sts"
      + type            = "AAAA"
      + zone_id         = "Z048504419NDW43VP1NZI"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.mta-sts.aws_s3_bucket.sts will be updated in-place
  ~ resource "aws_s3_bucket" "sts" {
        id                          = "mta-sts.kq4afy.xyz"
      ~ tags                        = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
        } -> (known after apply)
      ~ tags_all                    = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.mta-sts.aws_s3_bucket_object.favicon will be updated in-place
  ~ resource "aws_s3_bucket_object" "favicon" {
        id                     = "favicon.ico"
      ~ tags                   = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
        } -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.mta-sts.aws_s3_bucket_object.sts will be updated in-place
  ~ resource "aws_s3_bucket_object" "sts" {
        id                     = ".well-known/mta-sts.txt"
      ~ tags                   = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
          - "Version"   = "12399073059529760104"
        } -> (known after apply)
      ~ tags_all               = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
          - "Version"   = "12399073059529760104"
        } -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.mta-sts.aws_s3_bucket_policy.sts will be updated in-place
  ~ resource "aws_s3_bucket_policy" "sts" {
        id     = "mta-sts.kq4afy.xyz"
      ~ policy = jsonencode(
            {
              - Id        = "PolicyForCloudFrontPrivateContent"
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2SNU9MMSZ189X"
                        }
                      - Resource  = "arn:aws:s3:::mta-sts.kq4afy.xyz/*"
                      - Sid       = "1"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.mta-sts.module.acm.aws_acm_certificate.this[0] will be updated in-place
  ~ resource "aws_acm_certificate" "this" {
      ~ domain_validation_options = [
            # (1 unchanged element hidden)
        ]
        id                        = "arn:aws:acm:us-east-1:072105303426:certificate/007c9e59-4bec-4cc3-a3c8-800774f4bf22"
      ~ tags                      = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
          - "Changed"   = "2022-12-14 02:57 UTC"
          - "ManagedBy" = "Terraform"
        } -> (known after apply)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mta-sts.module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = "arn:aws:acm:us-east-1:072105303426:certificate/007c9e59-4bec-4cc3-a3c8-800774f4bf22"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.mta-sts.module.acm.aws_route53_record.validation[0] must be replaced
-/+ resource "aws_route53_record" "validation" {
      ~ fqdn            = "_4ad5739a3729acc44f2d20905e007897.mta-sts.kq4afy.xyz" -> (known after apply)
      ~ id              = "Z048504419NDW43VP1NZI__4ad5739a3729acc44f2d20905e007897.mta-sts.kq4afy.xyz._CNAME" -> (known after apply)
      ~ name            = "_4ad5739a3729acc44f2d20905e007897.mta-sts.kq4afy.xyz" -> (known after apply) # forces replacement
      ~ records         = [
          - "_16f4f23e1ee5955537e1eb491a7fd76e.pmgvbzmzyk.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 5 to add, 8 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.mta-sts.aws_s3_bucket.sts,
  on .terraform/modules/mta-sts/main.tf line 11, in resource "aws_s3_bucket" "sts":
  11: resource "aws_s3_bucket" "sts" {

Use the aws_s3_bucket_versioning resource instead

(and 9 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @jbouse, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*